org/livecoding.org
#+TITLE: Livecoding

live coding is the practice of making music on the fly with code,
though it could also be used to refer to other systems that involve the periodic editing and evaluation of code to produce effects on the fly

* Tutorials
https://github.com/tsoding/haskell-music
* Tools
https://github.com/agraef/purr-data
tidalcycles, or tidal, is a language for pattern live coding
https://github.com/lvm/build-supercollider supercollider is what most live coding engines are based on
