content/posts/livecoding.md
+++
title = "Livecoding"
author = ["Jacob Chvatal"]
lastmod = 2020-08-01T23:13:11-07:00
slug = "livecoding"
draft = false
+++

live coding is the practice of making music on the fly with code,
though it could also be used to refer to other systems that involve the periodic editing and evaluation of code to produce effects on the fly


## Tutorials {#tutorials}

<https://github.com/tsoding/haskell-music>


## Tools {#tools}

<https://github.com/agraef/purr-data>
tidalcycles, or tidal, is a language for pattern live coding
<https://github.com/lvm/build-supercollider> supercollider is what most live coding engines are based on
